In [2]:
import pandas as pd

In [3]:
path = 'data/csv_source/wilayah.csv'
df = pd.read_csv(path)

In [6]:
kode = ["31"]

def wilayah_filter(dframe, kode):
    if type(kode) == str:
        dframe = dframe[dframe['kode'].str.startswith(str(kode))]
    elif type(kode) == list:
        frames = [dframe[dframe['kode'].str.startswith(str(kd))] for kd in kode]
        dframe= pd.concat(frames)
    else:
        raise ValueError("Kode value must be string of number or list of string of number!")
    
    return dframe

wilayah_filter(df, kode)

                kode                    nama
27499             31             DKI JAKARTA
27500          31.01   KAB. ADM. KEP. SERIBU
27501       31.01.01  Kepulauan Seribu Utara
27502  31.01.01.1001          Pulau Panggang
27503  31.01.01.1002            Pulau Kelapa
...              ...                     ...
27812  31.75.10.1004                  Munjul
27813  31.75.10.1005                    Setu
27814  31.75.10.1006              Bambu Apus
27815  31.75.10.1007            Lubang Buaya
27816  31.75.10.1008                   Ceger

[318 rows x 2 columns]

In [26]:
df_prov = df[df['kode'].str.len()==2].copy()

In [27]:
df_kab = df[df['kode'].str.len()==5].copy()

In [28]:
df_kec = df[df['kode'].str.len()==8].copy()

In [29]:
df_kel = df[df['kode'].str.len()>8].copy()

In [31]:
# df_kab[df_kab['nama'].str.startswith('KOTA ADM.')]

In [32]:
df_kel

                kode               nama
27502  31.01.01.1001     Pulau Panggang
27503  31.01.01.1002       Pulau Kelapa
27504  31.01.01.1003      Pulau Harapan
27506  31.01.02.1001  Pulau Untung Jawa
27507  31.01.02.1002       Pulau Tidung
...              ...                ...
27812  31.75.10.1004             Munjul
27813  31.75.10.1005               Setu
27814  31.75.10.1006         Bambu Apus
27815  31.75.10.1007       Lubang Buaya
27816  31.75.10.1008              Ceger

[267 rows x 2 columns]